<!DOCTYPE html>
<html lang="fr">
	<head>
		<meta charset="utf-8">
		<meta name="description" content="Super blog" />

		<title>Blog - Parce que la vie est belle</title>

		<link rel="stylesheet" type="text/css" href="design.css" />
	</head>

	<body>
		<div id="page">
			<header>
				<h1><a href="index.html">Blog</a></h1>
				<p>O&ugrave; tu apprends pleins de trucs de ouf, comme comment devenir un h&eacute;ros !</p>
			</header>

			<div id="main">
				<aside id="about">
					<div class="menu">
						<div class="title purple">&Agrave; propos</div>

						<p>Je m'appelle Yannick et je d&eacute;veloppe des sites webs depuis 2007. Je suis un grand passionn&eacute; de l'informatique et ai donc des connaissances dans plusieurs langages de programmation, notamment le PHP et le Javascript. Mais j'ai aussi quelques connaissances en ActionScript 3, en Haxe et en Pascal.</p>
					</div>
				</aside>

				<section id="content">
					<article>
						<h2><a href="#">Comment qu'on fait &ccedil;a ?</a></h2>

						<p class="justify"><strong>Edit</strong> : Quelqu'un dans les commentaires me demande pourquoi mes articles datent de 1813 : enfaite c'est juste parce que je trouve &ccedil;a cool !</p>

						<p class="justify">Bien pour faire &ccedil;a, il suffit de... mais y a pas de vrai question ! Tu te fous de moi ?! D&eacute;gage de mon blog ! Ah, c'est moi qui ai donner ce titre ? Mince... Donc je devrais m'insulter ? Non, je ne penses pas parce que en fait... ben... au revoir !</p>

						<div class="infos">
							<a href="#" class="likes">3</a> &ndash; <a href="#">5 commentaires</a> &ndash; <span class="date">Le 18 mai 1813</span>
						</div>
					</article>

					<article>
						<h2><a href="#">Je veux &ecirc;tre un h&eacute;ros !</a></h2>

						<p class="justify">Bonjour chers lecteurs, aujourd'hui nous allons apprendre comment devenir un h&eacute;ros.</p>

						<p class="justify">Enfaite c'est tr&egrave;s simple, il y a seulement 342 r&egrave;gles &agrave; suivre :</p>

						<ul>
							<li><strong>&Ecirc;tre propre</strong> : lavez-vous r&eacute;guli&egrave;rement. Prenez une douche et non un bain, &ccedil;a &eacute;conomise de l'eau,</li>
							<li><strong>Se laver les dents</strong> r&eacute;guli&egrave;rement, sinon vous allez tuer des gens avec votre haleine de <a href="http://fr.wikipedia.org/wiki/Chacal">chacal</a>,</li>
							<li><strong>Devenir comp&eacute;tent</strong> dans plein de domaines : pompier, policier, plombier, etc. Sinon vous &ecirc;tes un gros nul,</li>
							<li><strong>&Ecirc;tre ouvert d'esprit</strong> : Sachez appr&eacute;cier toutes les cultures que rencontrer... Vous ne croyez pas au P&egrave;re No&euml;l ? Les enfants y croient pourtant, alors vous aussi !,</li>
							<li><strong>TOUJOURS porter des chaussettes</strong>, parce que les chaussettes c'est important,</li>
							<li><strong>&Ecirc;tre malin</strong> : un homme maintien deux bateaux en otage avec des bombes, que faites-vous ?,</li>
							<li><strong>Savoir appr&eacute;cier la vie</strong> car sinon vous allez vite devenir d&eacute;moraliser,</li>
							<li>(suite supprim&eacute;e car c'est juste un design, pas un vrai blog)</li>
						</ul>

						<p class="justify">D&eacute;sormais vous pourrez &ecirc;tre un h&eacute;ros ! :)</p>

						<div class="infos">
							<a href="#" class="likes likesactive">7856</a> &ndash; <a href="#">2585 commentaires</a> &ndash; <span class="date">Le 17 mai 1813</span>
						</div>
					</article>

					<article>
						<h2><a href="#">Coco popo</a></h2>

						<p class="justify">Bonjour les amis :)</p>

						<p class="justify">Je voulais juste expliquer un truc aux personnes qui apprennent des langages de programmation : une fois que vous avez compris les principes de base de la programmation, pour en apprendre un autre il ne suffit plus que d'apprendre la syntaxe et on peut tr&egrave;s rapidement conna&icirc;tre plusieurs langages.</p>

						<p>Le mieux, pour apprendre &agrave; utiliser un langage, une fois qu'on conna&icirc;t la syntaxe, est de regarder des codes source de programmes programm&eacute;s dans le langage que vous voulez apprendez &agrave; utiliser en se posant des questions simples, comme par exemple "Comment a t-il fait pour que quand on clic l&agrave;, il se passe &ccedil;a ?".</p>

						<p>Bien s&ucirc;r tout cela n'est bas&eacute; que sur ma propre exp&eacute;rience et n'est donc pas forc&eacute;ment la meilleure fa&ccedil;on de faire.</p>

						<div class="infos">
							<a href="#" class="likes">0</a> &ndash; <a href="#">587874 commentaires</a> &ndash; <span class="date">Le 16 mai 1813</span>
						</div>
					</article>

					<div id="navpage">
						<a href="#">&lt; Page pr&eacute;c&eacute;dente</a>
						<a href="#">Page suivante &gt;</a>
					</div>
				</section>

				<aside id="menu">
					<div class="menu">
						<div class="title red">Cat&eacute;gories</div>

						<nav>
							<ul>
								<li><a href="#">G&eacute;n&eacute;ral</a></li>
								<li><a href="#">Jeux</a></li>
								<li><a href="#">Design</a></li>
							</ul>
						</nav>
					</div>

					<div class="menu">
						<div class="title green">Derniers articles</div>

						<nav>
							<ul>
								<li><a href="#">Comment qu'on fait &ccedil;a ?</a></li>
								<li><a href="#">Je veux &ecirc;tre un h&eacute;ros !</a></li>
								<li><a href="#">Coco popo</a></li>
							</ul>
						</nav>
					</div>

					<div class="menu">
						<div class="title blue">Suivez-moi</div>

						<nav>
							<ul>
								<li><a href="#"><span class="icon-fb"></span> Facebook</a></li>
								<li><a href="#"><span class="icon-tw"></span> Twitter</a></li>
								<li><a href="#"><span class="icon-gp"></span> Google+</a></li>
								<li><a href="#"><span class="icon-rs"></span> RSS</a></li>
							</ul>
						</nav>
					</div>
				</aside>
			</div>

			<footer>
				(c) Pif - 2013
			</footer>
		</div>
	</body>
</html>
